In [1]:
import numpy as np
import pandas as pd

Usando DIccionarios

In [6]:
d={'a':10,'b':20,'c':30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Usando Indices

In [8]:
ser1 = pd.Series([1,2,3,4], index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2 = pd.Series([1,2,5,4], index=['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

### DataFrames

In [12]:
from numpy.random import randn
np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

### Selección e indexación

In [19]:
df['W']

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [20]:
df[['W','Z']]

          W         Z
A -1.467514  0.485809
B  0.392489  1.541990
C  0.666319  1.407338
D  0.641806  1.028293
E -1.972605 -1.223082

In [23]:
df.Z

A    0.485809
B    1.541990
C    1.407338
D    1.028293
E   -1.223082
Name: Z, dtype: float64

In [25]:
type(df['Z'])

pandas.core.series.Series

### Creando nuevas columnas

In [26]:
df['new'] = df['W']+ df['Z']
df

          W         X         Y         Z       new
A -1.467514 -0.494095 -0.162535  0.485809 -0.981705
B  0.392489  0.221491 -0.855196  1.541990  1.934479
C  0.666319 -0.538235 -0.568581  1.407338  2.073658
D  0.641806 -0.905100 -0.391157  1.028293  1.670099
E -1.972605 -0.866885  0.720788 -1.223082 -3.195687

### Eliminando columnas

In [1]:
df.drop('new', axis=1)

NameError: name 'df' is not defined

In [30]:
df.drop('new',axis=1, inplace=True)

KeyError: "['new'] not found in axis"

In [35]:
df['W']

A   -1.467514
B    0.392489
C    0.666319
D    0.641806
E   -1.972605
Name: W, dtype: float64

In [36]:
df.iloc[2]

W    0.666319
X   -0.538235
Y   -0.568581
Z    1.407338
Name: C, dtype: float64

In [37]:
df.loc['B','W']

0.39248881107944394

In [39]:
df.loc[['A','B'],['W','X']]

          W         X
A -1.467514 -0.494095
B  0.392489  0.221491

In [40]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [41]:
df>0

       W      X      Y      Z
A  False  False  False   True
B   True   True  False   True
C   True  False  False   True
D   True  False  False   True
E  False  False   True  False

In [42]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  0.485809
B  0.392489  0.221491       NaN  1.541990
C  0.666319       NaN       NaN  1.407338
D  0.641806       NaN       NaN  1.028293
E       NaN       NaN  0.720788       NaN

In [43]:
df[df['W']>0]

          W         X         Y         Z
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293

In [44]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.855196  0.221491
C -0.568581 -0.538235
D -0.391157 -0.905100

In [45]:
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [46]:
df

          W         X         Y         Z
A -1.467514 -0.494095 -0.162535  0.485809
B  0.392489  0.221491 -0.855196  1.541990
C  0.666319 -0.538235 -0.568581  1.407338
D  0.641806 -0.905100 -0.391157  1.028293
E -1.972605 -0.866885  0.720788 -1.223082

In [47]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.467514 -0.494095 -0.162535  0.485809
1     B  0.392489  0.221491 -0.855196  1.541990
2     C  0.666319 -0.538235 -0.568581  1.407338
3     D  0.641806 -0.905100 -0.391157  1.028293
4     E -1.972605 -0.866885  0.720788 -1.223082

In [48]:
newind = 'CA NY WY OR CO'.split()

In [50]:
df['States'] = newind
df

          W         X         Y         Z States
A -1.467514 -0.494095 -0.162535  0.485809     CA
B  0.392489  0.221491 -0.855196  1.541990     NY
C  0.666319 -0.538235 -0.568581  1.407338     WY
D  0.641806 -0.905100 -0.391157  1.028293     OR
E -1.972605 -0.866885  0.720788 -1.223082     CO

In [52]:
df.set_index('States', inplace=True)

In [53]:
df

               W         X         Y         Z
States
CA     -1.467514 -0.494095 -0.162535  0.485809
NY      0.392489  0.221491 -0.855196  1.541990
WY      0.666319 -0.538235 -0.568581  1.407338
OR      0.641806 -0.905100 -0.391157  1.028293
CO     -1.972605 -0.866885  0.720788 -1.223082

In [56]:
df.index

Index(['CA', 'NY', 'WY', 'OR', 'CO'], dtype='object', name='States')

In [57]:
df.reset_index(inplace=True)

In [58]:
df

  States         W         X         Y         Z
0     CA -1.467514 -0.494095 -0.162535  0.485809
1     NY  0.392489  0.221491 -0.855196  1.541990
2     WY  0.666319 -0.538235 -0.568581  1.407338
3     OR  0.641806 -0.905100 -0.391157  1.028293
4     CO -1.972605 -0.866885  0.720788 -1.223082

In [59]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.347901 -0.516565 -0.251336  0.648070
std    1.269797  0.452599  0.599531  1.123353
min   -1.972605 -0.905100 -0.855196 -1.223082
25%   -1.467514 -0.866885 -0.568581  0.485809
50%    0.392489 -0.538235 -0.391157  1.028293
75%    0.641806 -0.494095 -0.162535  1.407338
max    0.666319  0.221491  0.720788  1.541990

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   States  5 non-null      object
 1   W       5 non-null      float64
 2   X       5 non-null      float64
 3   Y       5 non-null      float64
 4   Z       5 non-null      float64
dtypes: float64(4), object(1)
memory usage: 328.0+ bytes

In [62]:
df.dtypes

States     object
W         float64
X         float64
Y         float64
Z         float64
dtype: object

### Missing Data
Mostraremos algunos métodos convenientes para lidiar con datos faltantes en pandas.

In [64]:
df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       1 non-null      float64
 2   C       3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

In [66]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [67]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [68]:
df.fillna(value='unk')

     A    B  C
0    1    5  1
1    2  unk  2
2  unk  unk  3

In [69]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [71]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [72]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

### Groupby

In [76]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','charly','Amy','Vanessa','Carl','Cara'],
       'Sales':[200,120,124,243,350,250]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG   charly    120
2    MSFT      Amy    124
3    MSFT  Vanessa    243
4      FB     Carl    350
5      FB     Cara    250

In [77]:
df.groupby('Company')

In [78]:
by_comp = df.groupby('Company')

In [79]:
by_comp.mean()

         Sales
Company
FB       300.0
GOOG     160.0
MSFT     183.5

In [80]:
by_comp.min()

        Person  Sales
Company
FB        Cara    250
GOOG       Sam    120
MSFT       Amy    124

In [81]:
by_comp.max()

          Person  Sales
Company
FB          Carl    350
GOOG      charly    200
MSFT     Vanessa    243

In [82]:
df.groupby('Company').std()

             Sales
Company
FB       70.710678
GOOG     56.568542
MSFT     84.145707

In [83]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

### Operaciones con elementos de DataFrame

In [85]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,777],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [86]:
df['col2']

0    444
1    555
2    666
3    777
Name: col2, dtype: int64

In [88]:
df['col2'].unique()

array([444, 555, 666, 777], dtype=int64)

In [89]:
df['col2'].nunique()

4

In [90]:
df['col2'].value_counts()

444    1
555    1
666    1
777    1
Name: col2, dtype: int64

In [93]:
newdf=df[(df['col1']>1) & (df['col2']==444)]
newdf

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [96]:
def times2(x):
    return x*2

In [97]:
df['col3'].apply(times2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [98]:
df.apply(len)

col1    4
col2    4
col3    4
dtype: int64

In [99]:
del df['col1']

In [100]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [102]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [103]:
df.index

RangeIndex(start=0, stop=4, step=1)